Nuclex.Game.Packing.RectanglePacker
Base class for rectangle packing algorithms
Remarks:
By uniting all rectangle packers under this common base class, you can
easily switch between different algorithms to find the most efficient or
performant one for a given job.
An almost exhaustive list of packing algorithms can be found here:
http://www.csc.liv.ac.uk/~epa/surveyhtml.html

Nuclex.Game.Packing.RectanglePacker.#ctor(System.Double,System.Double)
Initializes a new rectangle packer
packingAreaWidth: Width of the packing area
packingAreaHeight: Height of the packing area

Nuclex.Game.Packing.RectanglePacker.Pack(System.Double,System.Double)
Allocates space for a rectangle in the packing area
rectangleWidth: Width of the rectangle to allocate
rectangleHeight: Height of the rectangle to allocate
Returns: The location at which the rectangle has been placed

Nuclex.Game.Packing.RectanglePacker.TryPack(System.Double,System.Double,Autodesk.Revit.DB.UV@)
Tries to allocate space for a rectangle in the packing area
rectangleWidth: Width of the rectangle to allocate
rectangleHeight: Height of the rectangle to allocate
placement: Output parameter receiving the rectangle's placement
Returns: True if space for the rectangle could be allocated

Nuclex.Game.Packing.RectanglePacker.packingAreaWidth
Maximum allowed width of the packing area

Nuclex.Game.Packing.RectanglePacker.packingAreaHeight
Maximum allowed height of the packing area

Nuclex.Game.Packing.RectanglePacker.PackingAreaWidth
Maximum width the packing area is allowed to have

Nuclex.Game.Packing.RectanglePacker.PackingAreaHeight
Maximum height the packing area is allowed to have